In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
working_dir ='~/Project/pred-future-sales'

sales_train_file = pd.read_csv(working_dir + '/data/raw/sales_train.csv')
# shops_file = pd.read_csv(working_dir + '/data/raw/shops.csv')
# test_file = pd.read_csv(working_dir + '/data/raw/test.csv')
# items = pd.read_csv(working_dir + '/data/raw/items.csv')
# item_categories = pd.read_csv(working_dir + '/data/raw/item_categories.csv')
# sample_submission = pd.read_csv(working_dir + '/data/raw/sample_submission.csv')

In [3]:
sales_train_file.head(10)

         date  date_block_num  shop_id  item_id  item_price  item_cnt_day
0  02.01.2013               0       59    22154      999.00           1.0
1  03.01.2013               0       25     2552      899.00           1.0
2  05.01.2013               0       25     2552      899.00          -1.0
3  06.01.2013               0       25     2554     1709.05           1.0
4  15.01.2013               0       25     2555     1099.00           1.0
5  10.01.2013               0       25     2564      349.00           1.0
6  02.01.2013               0       25     2565      549.00           1.0
7  04.01.2013               0       25     2572      239.00           1.0
8  11.01.2013               0       25     2572      299.00           1.0
9  03.01.2013               0       25     2573      299.00           3.0

In [4]:
sales_train_file = sales_train_file.astype({'date': 'datetime64', 'date_block_num': 'int64', 'shop_id': 'int64', 
                         'item_id': 'int64', 'item_price': 'float64', 'item_cnt_day': 'float64'})

In [43]:
sales_train_file.head(5)

        date  date_block_num  shop_id  item_id  item_price  item_cnt_day
0 2013-02-01               0       59    22154      999.00           1.0
1 2013-03-01               0       25     2552      899.00           1.0
2 2013-05-01               0       25     2552      899.00          -1.0
3 2013-06-01               0       25     2554     1709.05           1.0
4 2013-01-15               0       25     2555     1099.00           1.0

In [9]:
sales_train_file[['date', 'date_block_num']].groupby('date_block_num').count()

                  date
date_block_num
0               115690
1               108613
2               121347
3                94109
4                91759
5               100403
6               100548
7               104772
8                96137
9                94202
10               96736
11              143246
12               99349
13               89830
14               92733
15               77906
16               78529
17               82408
18               78760
19               86614
20               73157
21               79361
22               86428
23              130786
24               88522
25               71808
26               69977
27               56274
28               54548
29               54617
30               55549
31               57029
32               50588
33               53514

In [10]:
train_total_file = pd.read_csv(working_dir + '/data/interim/train_total.csv')

In [12]:
train_total_file.head(10)

,shop_id,item_id,total_sales-1-2013,total_sales-2-2013,total_sales-3-2013,total_sales-4-2013,total_sales-5-2013,total_sales-6-2013,total_sales-7-2013,total_sales-8-2013,...,total_sales-7-2015,total_sales-8-2015,total_sales-9-2015,total_sales-10-2015,item_name,item_category_id,item_category_name,shop_name,combination_id,in_test
0,0,32,1326.0,2210.0,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,1+1,40,Кино - DVD,"!Якутск Орджоникидзе, 56 фран","(0, 32)",False
1,0,33,1041.0,1041.0,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,1+1 (BD),37,Кино - Blu-Ray,"!Якутск Орджоникидзе, 56 фран","(0, 33)",False
2,0,35,247.0,3458.0,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,10 ЛЕТ СПУСТЯ,40,Кино - DVD,"!Якутск Орджоникидзе, 56 фран","(0, 35)",False
3,0,43,221.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,100 МИЛЛИОНОВ ЕВРО,40,Кино - DVD,"!Якутск Орджоникидзе, 56 фран","(0, 43)",False
4,0,51,257.0,381.0,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,100 лучших произведений классики (mp3-CD) (Dig...,57,Музыка - MP3,"!Якутск Орджоникидзе, 56 фран","(0, 51)",False
5,0,61,195.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,1000 и одна ночь 2CD (mp3-DVD) (DVD-Book),43,Книги - Аудиокниги,"!Якутск Орджоникидзе, 56 фран","(0, 61)",False
6,0,75,76.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,12 ДРУЗЕЙ ОУШЕНА WB (регион),40,Кино - DVD,"!Якутск Орджоникидзе, 56 фран","(0, 75)",False
7,0,88,76.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,13 ДРУЗЕЙ ОУШЕНА WB (регион),40,Кино - DVD,"!Якутск Орджоникидзе, 56 фран","(0, 88)",False
8,0,95,193.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,1812. ЭНЦИКЛОПЕДИЯ ВЕЛИКОЙ ВОЙНЫ,40,Кино - DVD,"!Якутск Орджоникидзе, 56 фран","(0, 95)",False
9,0,96,70.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,1812. ЭНЦИКЛОПЕДИЯ ВОЙНЫ (регион),40,Кино - DVD,"!Якутск Орджоникидзе, 56 фран","(0, 96)",False

In [5]:
 test_file = pd.read_csv(working_dir + '/data/raw/test.csv')

In [6]:
test_file.head()

   ID  shop_id  item_id
0   0        5     5037
1   1        5     5320
2   2        5     5233
3   3        5     5232
4   4        5     5268